setwd("Data")

police_num<-read.csv("경찰관수.csv",fileEncoding = "euc-kr")
total_Crime<-read.csv("5대범죄발생및검거수.csv",fileEncoding = "euc-kr")

강남구<-total_Crime[total_Crime$구분=="강남",]
강남구<-강남구[강남구$발생검거=="발생",]
강남구<-강남구[-c(1,2,3)]
강남구<-sum(강남구)

강동구<-total_Crime[total_Crime$구분=="강동",]
강동구<-강동구[강동구$발생검거=="발생",]
강동구<-강동구[-c(1,2,3)]
강동구<-sum(강동구)

강북구<-total_Crime[total_Crime$구분=="강북",]
강북구<-강북구[강북구$발생검거=="발생",]
강북구<-강북구[-c(1,2,3)]
강북구<-sum(강북구)

강서구<-total_Crime[total_Crime$구분=="강서",]
강서구<-강서구[강서구$발생검거=="발생",]
강서구<-강서구[-c(1,2,3)]
강서구<-sum(강서구)

관악구<-total_Crime[total_Crime$구분=="관악",]
관악구<-관악구[관악구$발생검거=="발생",]
관악구<-관악구[-c(1,2,3)]
관악구<-sum(관악구)

광진구<-total_Crime[total_Crime$구분=="광진",]
광진구<-광진구[광진구$발생검거=="발생",]
광진구<-광진구[-c(1,2,3)]
광진구<-sum(광진구)

구로구<-total_Crime[total_Crime$구분=="구로",]
구로구<-구로구[구로구$발생검거=="발생",]
구로구<-구로구[-c(1,2,3)]
구로구<-sum(구로구)

금천구<-total_Crime[total_Crime$구분=="금천",]
금천구<-금천구[금천구$발생검거=="발생",]
금천구<-금천구[-c(1,2,3)]
금천구<-sum(금천구)

노원구<-total_Crime[total_Crime$구분=="노원",]
노원구<-노원구[노원구$발생검거=="발생",]
노원구<-노원구[-c(1,2,3)]
노원구<-sum(노원구)

도봉구<-total_Crime[total_Crime$구분=="도봉",]
도봉구<-도봉구[도봉구$발생검거=="발생",]
도봉구<-도봉구[-c(1,2,3)]
도봉구<-sum(도봉구)

동대문구<-total_Crime[total_Crime$구분=="동대문",]
동대문구<-동대문구[동대문구$발생검거=="발생",]
동대문구<-동대문구[-c(1,2,3)]
동대문구<-sum(동대문구)

동작구<-total_Crime[total_Crime$구분=="동작",]
동작구<-동작구[동작구$발생검거=="발생",]
동작구<-동작구[-c(1,2,3)]
동작구<-sum(동작구)

마포구<-total_Crime[total_Crime$구분=="마포",]
마포구<-마포구[마포구$발생검거=="발생",]
마포구<-마포구[-c(1,2,3)]
마포구<-sum(마포구)

서대문구<-total_Crime[total_Crime$구분=="서대문",]
서대문구<-서대문구[서대문구$발생검거=="발생",]
서대문구<-서대문구[-c(1,2,3)]
서대문구<-sum(서대문구)

서초구<-total_Crime[total_Crime$구분=="서초",]
서초구<-서초구[서초구$발생검거=="발생",]
서초구<-서초구[-c(1,2,3)]
서초구<-sum(서초구)

성동구<-total_Crime[total_Crime$구분=="성동",]
성동구<-성동구[성동구$발생검거=="발생",]
성동구<-성동구[-c(1,2,3)]
성동구<-sum(성동구)

성북구<-total_Crime[total_Crime$구분=="성북",]
성북구<-성북구[성북구$발생검거=="발생",]
성북구<-성북구[-c(1,2,3)]
성북구<-sum(성북구)

송파구<-total_Crime[total_Crime$구분=="송파",]
송파구<-송파구[송파구$발생검거=="발생",]
송파구<-송파구[-c(1,2,3)]
송파구<-sum(송파구)

양천구<-total_Crime[total_Crime$구분=="양천",]
양천구<-양천구[양천구$발생검거=="발생",]
양천구<-양천구[-c(1,2,3)]
양천구<-sum(양천구)

영등포구<-total_Crime[total_Crime$구분=="영등포",]
영등포구<-영등포구[영등포구$발생검거=="발생",]
영등포구<-영등포구[-c(1,2,3)]
영등포구<-sum(영등포구)

용산구<-total_Crime[total_Crime$구분=="용산",]
용산구<-용산구[용산구$발생검거=="발생",]
용산구<-용산구[-c(1,2,3)]
용산구<-sum(용산구)

은평구<-total_Crime[total_Crime$구분=="은평",]
은평구<-은평구[은평구$발생검거=="발생",]
은평구<-은평구[-c(1,2,3)]
은평구<-sum(은평구)

종로구<-total_Crime[total_Crime$구분=="종로",]
종로구<-종로구[종로구$발생검거=="발생",]
종로구<-종로구[-c(1,2,3)]
종로구<-sum(종로구)

중구<-total_Crime[total_Crime$구분=="중부",]
중구
중구<-중구[중구$발생검거=="발생",]
중구<-중구[-c(1,2,3)]
중구<-sum(중구)

중랑구<-total_Crime[total_Crime$구분=="중랑",]
중랑구<-중랑구[중랑구$발생검거=="발생",]
중랑구<-중랑구[-c(1,2,3)]
중랑구<-sum(중랑구)

total_Crime<-rbind(강남구,강동구,강북구,강서구,관악구,광진구,구로구,금천구,노원구,
                      도봉구,동대문구,동작구,마포구,서대문구,서초구,성동구,성북구,송파구,양천구,영등포구,
                      용산구,은평구,종로구,중구,중랑구)
write.csv(total_Crime, "../Output/Data/total_Crime.csv", row.names=T,,fileEncoding = "euc-kr")